Revit 2026 API

# DocumentSetDefaultFamilyTypeId Method

---

Sets the default family type id for the given family category.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetDefaultFamilyTypeId(
	ElementId familyCategoryId,
	ElementId familyTypeId
)
```
```vb
Public Sub SetDefaultFamilyTypeId (
	familyCategoryId As ElementId,
	familyTypeId As ElementId
)
```
```cpp
public:
void SetDefaultFamilyTypeId(
	ElementId^ familyCategoryId,
	ElementId^ familyTypeId
)
```
```fsharp
member SetDefaultFamilyTypeId :
        familyCategoryId : ElementId *
        familyTypeId : ElementId -> unit
```

#### Parameters

familyCategoryId ElementId
     The family category id.
familyTypeId ElementId
     The default family type id.

| Exception | Condition |
| --- | --- |
| ArgumentException | The family type id familyTypeId is invalid for the give family category familyCategoryId. -or- familyCategoryId is not a built in category or parameter Element ID. |
| ArgumentNullException | A non-optional argument was null |

#### Reference

Document Class

Autodesk.Revit.DB Namespace